IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28p65x_uid_regs.xml
<module id="UID_REGS" HW_revision="" description="UID Registers">
	<register id="UID_PSRAND0" width="32" page="1" offset="0x0" internal="0" description="UID Psuedo-random 160 bit number">
		<bitfield id="RandomID" description="Random Identifier" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="UID_PSRAND1" width="32" page="1" offset="0x2" internal="0" description="UID Psuedo-random 160 bit number">
		<bitfield id="RandomID" description="Random Identifier" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="UID_PSRAND2" width="32" page="1" offset="0x4" internal="0" description="UID Psuedo-random 160 bit number">
		<bitfield id="RandomID" description="Random Identifier" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="UID_PSRAND3" width="32" page="1" offset="0x6" internal="0" description="UID Psuedo-random 160 bit number">
		<bitfield id="RandomID" description="Random Identifier" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="UID_PSRAND4" width="32" page="1" offset="0x8" internal="0" description="UID Psuedo-random 160 bit number">
		<bitfield id="RandomID" description="Random Identifier" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="UID_UNIQUE0" width="32" page="1" offset="0xa" internal="0" description="UID Unique 64 bit number">
		<bitfield id="UniqueID" description="Unique Identifier" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="UID_UNIQUE1" width="32" page="1" offset="0xc" internal="0" description="UID Unique 64 bit number">
		<bitfield id="UniqueID" description="Unique Identifier" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="UID_CHECKSUM" width="32" page="1" offset="0xe" internal="0" description="UID Checksum">
		<bitfield id="Checksum" description="Checksum" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
</module>
